doc/2018-12-04-interpolation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-15 Sat 19:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computing elimination polynomials using interpolation</title>
<meta name="author" content="Thibaut" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../w3.css" />
<link rel="stylesheet" type="text/css" href="../w3-theme-myblue.css" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="stylesheet" type="text/css" href="../orgstyle-main.css" />
<link rel="stylesheet" href='https://fonts.googleapis.com/css?family=Roboto' />
<link rel="stylesheet" href="../font/font-awesome-4.7.0/font-awesome-4.7.0/css/font-awesome.min.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-problem" class="outline-2">
<h2 id="problem">Problem</h2>
<div class="outline-text-2" id="text-problem">
<p>
When one wants to eliminate one or several variables from a system,
the result may have very large degree.
</p>

<p>
This makes the computations very difficult.
</p>

<p>
It is sometimes worthwile to try using evaluation and interpolation
techniques.
</p>
</div>
</div>

<div id="outline-container-example" class="outline-2">
<h2 id="example">Example system</h2>
<div class="outline-text-2" id="text-example">
<p>
<a href="http://mercurey.gforge.inria.fr/">http://mercurey.gforge.inria.fr/</a>
</p>

<p>
Loading relevant libraries:
</p>
<div class="org-src-container">
<pre class="src src-maple">with(LinearAlgebra): 
with(VectorCalculus): 
with(combinat):
</pre>
</div>

<p>
System definition:
</p>
<div class="org-src-container">
<pre class="src src-maple">d1 := g1-G1; d2 := g2-G2;
MatrixD := Matrix([[-G1*y1, -z1-1, d1*z1-G1, 2*d1*y1],
                   [-g1*z1, y1, d1*y1, -2*d1*z1+G1-d1],
                   [-G2*y2, -z2-1, d2*z2-G2, 2*d2*y2],
                   [-g2*z2, y2, d2*y2, -2*d2*z2+G2-d2]]);

vars := [y1, y2, z1, z2];
g1 := 1; # Dehomogenization
params := [G1, g2, G2]

k := 4; n := 4; t := 2;

detD := Determinant(MatrixD):

sys := [detD, seq(diff(detD, v), v in vars)]:
</pre>
</div>

<p>
Some measures:
</p>
<div class="org-src-container">
<pre class="src src-maple">nops(sys);
map(degree, sys, y1);
map(degree, sys, y2);
map(degree, sys, z1);
map(degree, sys, z2);
map(degree, sys, G1);
map(degree, sys, g2);
map(degree, sys, G2);
</pre>
</div>
</div>
</div>

<div id="outline-container-direct-calc" class="outline-2">
<h2 id="direct-calc">Trying a direct calculation</h2>
<div class="outline-text-2" id="text-direct-calc">
<p>
We want a polynomial in one of y1, y2, z1 or z2, together with g2, G1
and G2.
</p>

<p>
In other words, we want to compute an <b>elimination polynomial</b>. There
are many tools for that, I usually use Gröbner bases, which I compute
using Jean-Charles Faugère's FGb package for Maple.
</p>

<p>
<a href="https://www-polsys.lip6.fr/~jcf/FGb/index.html">https://www-polsys.lip6.fr/~jcf/FGb/index.html</a>
</p>

<div class="org-src-container">
<pre class="src src-maple">with(FGb);
# This is FGb version 1.68
</pre>
</div>

<p>
So, let's try to find a polynomial in y2:
</p>

<div class="org-src-container">
<pre class="src src-maple">gb := fgb_gbasis_elim(sys,0,[z1,z2,y1],[y2,g2,G2,G1],{"verb"=3}):
</pre>
</div>

<p>
The degree increases, so does the size of the matrices, and the time
needed to construct them&#x2026;
</p>
</div>

<div id="outline-container-how-big" class="outline-3">
<h3 id="how-big">How long will we need to wait?</h3>
<div class="outline-text-3" id="text-how-big">
<p>
We need to know the degree that we will need to reach.
</p>

<p>
How to do it? Fix some values for some variables, compute with what
remains, see the degree of the result.
</p>

<p>
Let's start with y2:
</p>

<div class="org-src-container">
<pre class="src src-maple">randomize():
randval := rand(100..10000):

sys_simpler := eval(sys,{G1=randval(),G2=randval(),g2=randval()}):
gb_simpler := fgb_gbasis(sys_simpler,0,[z1,z2,y1],[y2,g2,G2,G1],{"verb"=3}):

nops(gb_simpler);
map(indets, gb_simpler);
map(irreduc,gb_simpler);
map(degree, gb_simpler);     # Relevant value !!!
map(degree, gb_simpler, y1);
map(degree, gb_simpler, y2);
map(degree, gb_simpler, [y1,y2]);
</pre>
</div>

<p>
As a bonus, we observe that the result seems to be y2*(a degree 4 polynomial in y2)
Let's simplify the system in consequence:
</p>

<div class="org-src-container">
<pre class="src src-maple">sys0 := sys:

sys := [y2*u-1,       # y2 &lt;&gt; 0
        y2^2 - Y2,    # change of variables, could also be done with repeated calls to algsubs
        # y2*Y1 - y1, # another possible simplification which I don't justify here
        op(sys0)
       ]:
</pre>
</div>
</div>
</div>

<div id="outline-container-degree-estimate" class="outline-3">
<h3 id="degree-estimate">But we still don't know the degree in the g2,G2,G1.</h3>
<div class="outline-text-3" id="text-degree-estimate">
<p>
One way to get a quick estimate is to use the same calculation, and
look at the size of the coefficients.
</p>

<div class="org-src-container">
<pre class="src src-maple">sys_simpler := eval(sys,{G1=10,G2=21,g2=31}): # ~10, linear combinations ~10, and coprime
gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
map(x -&gt; evalf(log(abs(x))/log(10)),[coeffs(pol)]);
</pre>
</div>

<p>
So, total degree between 23 and 25.
</p>

<p>
And if we want the degree in each of the gi:
</p>

<div class="org-src-container">
<pre class="src src-maple">sys_simpler := eval(sys,{G1=101,G2=2,g2=3}):
gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
map(x -&gt; evalf(log(abs(x))/log(100)),[coeffs(pol)]);
# In G1: 7 to 9

sys_simpler := eval(sys,{G1=2,G2=101,g2=3}):
gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
map(x -&gt; evalf(log(abs(x))/log(100)),[coeffs(pol)]);
# In G2: 14 to 19

sys_simpler := eval(sys,{G1=2,G2=3,g2=101}):
gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
map(x -&gt; evalf(log(abs(x))/log(100)),[coeffs(pol)]);
# In g2: 13 to 16
</pre>
</div>

<p>
It's still not very precise.
</p>

<p>
The best way is of course to do the same as we did with y2.
</p>

<p>
<b>Remark:</b> since we're only interested in the degree, we can do the
computations modulo p and save a bit of time (sub-linear, since fgb
uses CRT reconstruction behind the scenes).
</p>

<div class="org-src-container">
<pre class="src src-maple">sys_simpler := eval(sys,{Y2=randval(),G2=randval(),g2=randval()}):
gb_simpler := fgb_gbasis_elim(sys_simpler,65521,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
degree(pol);
# 9 in G1

sys_simpler := eval(sys,{Y2=randval(),G1=randval(),g2=randval()}):
gb_simpler := fgb_gbasis_elim(sys_simpler,65521,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
degree(pol);
# 19 in G2

sys_simpler := eval(sys1,{Y2=randval(),G1=randval(),G2=randval()}):
gb_simpler := fgb_gbasis_elim(sys_simpler,65521,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

pol := gb_simpler[1];
degree(pol);
# 19 in g2
</pre>
</div>

<p>
So the final result has (at best) degree 19+4=23.
</p>

<p>
The complexity scales like binomial(n,n+d)<sup>k</sup> where n is the number of
variables, d the maximal degree and k some number between 1.9 and 3
(or omega)
</p>

<p>
If the polynomial we want to compute is f(x,y) with degree 4 in x
and degree 20 in y, it's significantly faster to compute 21+epsilon
bases in degree 4 and reconstruct f, than to compute one basis in
degree 24.
</p>

<p>
But real-life cases are never that not usually that clear-cut.
</p>
</div>
</div>
</div>

<div id="outline-container-evaluation" class="outline-2">
<h2 id="evaluation">Specialization</h2>
<div class="outline-text-2" id="text-evaluation">
<p>
So let's see if we can make it work with interpolation here.
And let's use g2 as the interpolation variable.
</p>
</div>

<div id="outline-container-checking-deg-estimate" class="outline-3">
<h3 id="checking-deg-estimate">First, we need to make sure that our degree estimate is correct.</h3>
<div class="outline-text-3" id="text-checking-deg-estimate">
<div class="org-src-container">
<pre class="src src-maple" id="orge223844">for i from 1 to 20 do
    sys_simpler := eval(sys,{Y2=randval(),G1=randval(),G2=randval()}):
    gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1]):

    pol := gb_simpler[1]:
    print(degree(pol));
od:
</pre>
</div>

<p>
So, 19 seems to be correct.
</p>
</div>
</div>

<div id="outline-container-specializing-g2" class="outline-3">
<h3 id="specializing-g2">Second, let's see if specializing g2 is enough to complete the computation</h3>
<div class="outline-text-3" id="text-specializing-g2">
<p>
&#x2026; It would be, but not enough to complete the computation many times in less than 20 minutes, so I will cheat.
</p>

<div class="org-src-container">
<pre class="src src-maple">sys1 := sys;
sys := eval(sys1,{G1=11,G2=5}):
</pre>
</div>

<p>
After cheating, it is enough!
</p>

<div class="org-src-container">
<pre class="src src-maple">sys_g2 := eval(sys,{g2=randval()}):
gb_g2 := fgb_gbasis_elim(sys_g2,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1],{"verb"=3}):

nops(gb_g2);
</pre>
</div>
</div>
</div>

<div id="outline-container-how-many-times" class="outline-3">
<h3 id="how-many-times">Then, we need to see how many times we will have to do the specialized computation</h3>
<div class="outline-text-3" id="text-how-many-times">
<p>
If we want to interpolate coefficients with degree 19 in g2, we need
to compute the polynomial 20 times.
</p>

<p>
We can't just use polynomial interpolation, because the GB
computations may have simplified some results. For example, if we
want to recover x*y + 2 by interpolating on x, and we only pick even
values of x:
x=2 -&gt; 2*y + 2, simplified into y+1
x=4 -&gt; 4*y + 2, simplified into y+1/2
x=6 -&gt; 6*y + 2, simplified into y+1/3
and polynomial interpolation would conclude that the constant coefficient is 1.
</p>

<p>
This is because the Gröbner basis is not computed over Z but over Q!
</p>

<p>
So we will have to:
</p>

<ol class="org-ol">
<li>Normalize the intermediate results (for example ensuring that the
leading coefficient is always 1)</li>
<li>Use rational reconstruction to recover the result (to account for
those denominators we introduced)</li>
</ol>

<p>
In order to determine how many sample values we need:
</p>

<ol class="org-ol">
<li>Start with the degree bound you have found: 19</li>
<li>Add one for the interpolation: 20</li>
<li>Add some safety net in case we were really lucky (or unlucky) when determining the degree: 25</li>
<li>Multiply by 2 to account for the denominator: 50</li>
</ol>

<p>
Now we can evaluate:
</p>

<div class="org-src-container">
<pre class="src src-maple">nvals := 50:

xvals := []:
yvals := []:
for i from 1 to nvals do
    printf("%a/%a\n",i,nvals):
    g2_val := randval();
    while g2_val in xvals do
        g2_val := randval();
    od:
    sys_g2 := eval(sys,{g2=g2_val});
    gb_g2 := fgb_gbasis_elim(sys_g2,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1]):
    pol_g2 := gb_g2[1];
    xvals := [g2_val,op(xvals)]:
    yvals := [pol_g2,op(yvals)]:
od:
</pre>
</div>

<p>
and normalize:
</p>

<div class="org-src-container">
<pre class="src src-maple">yyvals := map(y -&gt; y/lcoeff(y), yvals):
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-reconstruction" class="outline-2">
<h2 id="reconstruction">Reconstruction</h2>
<div class="outline-text-2" id="text-reconstruction">
<p>
And now it is time to reconstruct.
</p>

<p>
Rational reconstruction will give us a rational function
N(g2,Y2)/D(g2) which is congruent to yvals[i] modulo &lt;g2 - xvals[i]&gt;
for all i.
And the polynomial that we want is just N(g2,Y2).
</p>

<p>
Rational reconstruction in maple is done with the function ratrecon
</p>

<p>
<a href="https://www.maplesoft.com/support/help/maple/view.aspx?path=ratrecon">https://www.maplesoft.com/support/help/maple/view.aspx?path=ratrecon</a>
</p>

<p>
To call it, we have to construct a polynomial u and a
polynomial m so that "N/D is congruent to yvals[i]
modulo &lt;g2 - xvals[i]&gt; for all i" is equivalent to
"N/D is congruent to u modulo m".
</p>

<p>
m is the product of the g2 - xvals[i] for all i
</p>

<p>
u has to be constructed using interpolation.
</p>

<p>
<a href="https://www.maplesoft.com/support/help/maple/view.aspx?path=CurveFitting%2fPolynomialInterpolation">https://www.maplesoft.com/support/help/maple/view.aspx?path=CurveFitting%2fPolynomialInterpolation</a>
</p>

<div class="org-src-container">
<pre class="src src-maple">with(CurveFitting):

pp := PolynomialInterpolation(xvals,yyvals,g2):

degree(pp,Y2);
degree(pp,g2); # too much
</pre>
</div>

<p>
And then we use ratrecon to obtain a smaller representative:
</p>

<div class="org-src-container">
<pre class="src src-maple">m := mul(g2-x,x in xvals):
rat := ratrecon(pp,m,g2,24,24):

res := numer(rat):
</pre>
</div>

<p>
Let's see if this one is small enough:
</p>

<div class="org-src-container">
<pre class="src src-maple">degree(res,Y2);
degree(res,g2);
</pre>
</div>
</div>

<div id="outline-container-is-this-good" class="outline-3">
<h3 id="is-this-good">Is this good?</h3>
<div class="outline-text-3" id="text-is-this-good">
<p>
Wait&#x2026; Why 18?
</p>

<p>
We found degree 19 before in one of the specializations (all of them
actually), so the resulting polynomial can NOT have degree less than
</p>
<ol class="org-ol">
<li></li>
</ol>

<p>
What happened?
</p>

<p>
Imagine that you want to reconstruct x*y + x by interpolating on x.
x=2 -&gt; 2*y+2 simplifies to y+1
x=3 -&gt; 3*y+3 simplifies to y+1
Etc.
</p>

<p>
The same happens any time the polynomial you want to reconstruct is
A(x)*B(x,y): after evaluating, A(x) becomes just a scalar factor in
the computations and it is impossible to recover it.
</p>

<p>
To recover it, there are two possibilities.
</p>

<p>
(1) We don't have to interpolate on specific variables. We can
    interpolate along a random line (e.g. choose a random v = 13*x +
    23*y + 7, instead of a random x before).
</p>

<p>
Then generically on the choice of the line, the problem doesn't
appear. And if it still happens, it means that the polynomial has a
factor A(13*x + 23*y + 7).
</p>

<p>
If we repeat the computations with another line (say, choosing v =
x + 3*y + 12), we should find that factor in the result. That is,
unless A actually only depends on (13*x + 23*y + 7)*(x + 3*y +
12)&#x2026;
</p>

<p>
But realistically, the process terminates fast. However, it
completely destroys the structure of the system (that's the whole
point!) which makes the computation of the GB potentially slower.
</p>

<p>
But there is a better way!
</p>

<p>
(2) If we evaluate A(x)*B(x,y) at random values of y, we obtain
    A(x)*B(x,v) for a lot of different v. Then A(x) is just the gcd of
    all those polynomials.
</p>

<p>
In reality, for a polynomial in n variables where we
evaluate/interpolate on 1, we would have
F(x,y1,&#x2026;,y(n-1)) = A(x)*B(x,y1,&#x2026;,y(n-1))
and we would find A by evaluating F at random values of y1&#x2026;y(n-1).
</p>

<p>
Those are very cheap computations, since they are univariate.
</p>

<p>
And even better, those are computations that we are ALREADY doing: <a href="#orge223844">1</a> .
</p>

<div class="org-src-container">
<pre class="src src-maple">common_div := 0;
for i from 1 to 20 do
    sys_simpler := eval(sys,{Y2=randval(),G1=randval(),G2=randval()}):
    # Need to use the same values for G1 and G2, since they may appear
    # in that factor

    gb_simpler := fgb_gbasis_elim(sys_simpler,0,[y2,u,z1,z2,y1,Y1],[Y2,g2,G2,G1]):
    # !!! No modulo p here

    pol := gb_simpler[1]:
    common_div := gcd(common_div,pol):
    print(degree(pol));
od:
print(common_div);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion">Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<div class="org-src-container">
<pre class="src src-maple">final_res := res*common_div;
print(collect(final_res,Y2,factor));
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thibaut</p>
<p class="date">Created: 2025-03-15 Sat 19:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
